clear;
%Παλινδρομητης
Gamma=[0.001 0 0 0;0 0.001 0 0; 0 0 0.001 0; 0 0 0 0.0005;];
lamda=3.5*eye(2);
K=400*eye(2);
%τετραγωνική είσοδος
plot_palindromiti(lamda,K,Gamma,1);
%ημιτονοείδης είσοδος
plot_palindromiti(lamda,K,Gamma,2);
%ΠΕΜΑ
a1=-700*[  1 0 1 0;0 1 0 1;];
b1=-8000*[  1.3125 0 0.0312 0;0 0.0312 0 0.0664;];
a2=700*[  1 0 1 0;0 1 0 1;];
b2=8000*[  1.3125 0 0.0312 0;0 0.0312 0 0.0664;];
%τετραγωνική είσοδος
sae_PEMA(a1,b1,a2,b2,1);
%ημιτονοείδης είσοδος
sae_PEMA(a1,b1,a2,b2,2);